Revit 2027 API
ReinforcementSettings.GetReinforcementAbbreviationTag Method
 Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType
)
Public Function GetReinforcementAbbreviationTag (
	tagType As ReinforcementAbbreviationTagType
) As String
public:
String^ GetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType
)
member GetReinforcementAbbreviationTag :
        tagType : ReinforcementAbbreviationTagType -> string
Parameters
tagType ReinforcementAbbreviationTagType
 Defines the type of abbreviation tag.
Return Value
String
 Abbreviation tag value
Exceptions
Exception | Condition
ArgumentException |  The abbreviation type tagType is not valid
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace